In [7]:
import pandas as pd
import numpy as np

In [13]:
# Load datasets
transactions = pd.read_csv("/Users/deepakpatil/coffee-and-code/data_analyst/Credit Card Transaction and Customer Risk Analytics for a Digital Bank/dataset/transactions_data.csv")
users = pd.read_csv("/Users/deepakpatil/coffee-and-code/data_analyst/Credit Card Transaction and Customer Risk Analytics for a Digital Bank/dataset/users_data.csv")
cards = pd.read_csv("/Users/deepakpatil/coffee-and-code/data_analyst/Credit Card Transaction and Customer Risk Analytics for a Digital Bank/dataset/cards_data.csv")

# Display first few rows
transactions.head(), users.head(), cards.head()

(        id                 date  client_id  card_id   amount  \
 0  7475327  2010-01-01 00:01:00       1556     2972  $-77.00
 1  7475328  2010-01-01 00:02:00        561     4575   $14.57
 2  7475329  2010-01-01 00:02:00       1129      102   $80.00
 3  7475331  2010-01-01 00:05:00        430     2860  $200.00
 4  7475332  2010-01-01 00:06:00        848     3915   $46.41

             use_chip  merchant_id merchant_city merchant_state      zip   mcc  \
 0  Swipe Transaction        59935        Beulah             ND  58523.0  5499
 1  Swipe Transaction        67570    Bettendorf             IA  52722.0  5311
 2  Swipe Transaction        27092         Vista             CA  92084.0  4829
 3  Swipe Transaction        27092   Crown Point             IN  46307.0  4829
 4  Swipe Transaction        13051       Harwood             MD  20776.0  5813

   errors
 0    NaN
 1    NaN
 2    NaN
 3    NaN
 4    NaN  ,
      id  current_age  retirement_age  birth_year  birth_month  gender  \
 0   825           53              66        1966           11  Female
 1  1746           53              68        1966           12  Female
 2  1718           81              67        1938           11  Female
 3   708           63              63        1957            1  Female
 4  1164           43              70        1976            9    Male

                     address  latitude  longitude per_capita_income  \
 0             462 Rose Lane     34.15    -117.76            $29278
 1    3606 Federal Boulevard     40.76     -73.74            $37891
 2           766 Third Drive     34.02    -117.89            $22681
 3          3 Madison Street     40.71     -73.99           $163145
 4  9620 Valley Stream Drive     37.76    -122.44            $53797

   yearly_income total_debt  credit_score  num_credit_cards
 0        $59696    $127613           787                 5
 1        $77254    $191349           701                 5
 2        $33483       $196           698                 5
 3       $249925    $202328           722                 4
 4       $109687    $183855           675                 1  ,
      id  client_id  card_brand        card_type       card_number  expires  \
 0  4524        825        Visa            Debit  4344676511950444  12/2022
 1  2731        825        Visa            Debit  4956965974959986  12/2020
 2  3701        825        Visa            Debit  4582313478255491  02/2024
 3    42        825        Visa           Credit  4879494103069057  08/2024
 4  4659        825  Mastercard  Debit (Prepaid)  5722874738736011  03/2009

    cvv has_chip  num_cards_issued credit_limit acct_open_date  \
 0  623      YES                 2       $24295        09/2002
 1  393      YES                 2       $21968        04/2014
 2  719      YES                 2       $46414        07/2003
 3  693       NO                 1       $12400        01/2003
 4   75      YES                 1          $28        09/2008

    year_pin_last_changed card_on_dark_web
 0                   2008               No
 1                   2014               No
 2                   2004               No
 3                   2012               No
 4                   2009               No  )

In [15]:
# Quick data overview
transactions.info()
users.info()
cards.info()

# Check missing values
print("Transactions Missing:\n", transactions.isnull().sum())
print("Users Missing:\n", users.isnull().sum())
print("Cards Missing:\n", cards.isnull().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13305915 entries, 0 to 13305914
Data columns (total 12 columns):
 #   Column          Dtype
---  ------          -----
 0   id              int64
 1   date            object
 2   client_id       int64
 3   card_id         int64
 4   amount          object
 5   use_chip        object
 6   merchant_id     int64
 7   merchant_city   object
 8   merchant_state  object
 9   zip             float64
 10  mcc             int64
 11  errors          object
dtypes: float64(1), int64(5), object(6)
memory usage: 1.2+ GB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 2000 non-null   int64
 1   current_age        2000 non-null   int64
 2   retirement_age     2000 non-null   int64
 3   birth_year         2000 non-null   int64
 4   birth_month        2000 non-null   int64
 5   gender             2000 non-null   object
 6   address            2000 non-null   object
 7   latitude           2000 non-null   float64
 8   longitude          2000 non-null   float64
 9   per_capita_income  2000 non-null   object
 10  yearly_income      2000 non-null   object
 11  total_debt         2000 non-null   object
 12  credit_score       2000 non-null   int64
 13  num_credit_cards   2000 non-null   int64
dtypes: float64(2), int64(7), object(5)
memory usage: 218.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6146 entries, 0 to 6145
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     6146 non-null   int64
 1   client_id              6146 non-null   int64
 2   card_brand             6146 non-null   object
 3   card_type              6146 non-null   object
 4   card_number            6146 non-null   int64
 5   expires                6146 non-null   object
 6   cvv                    6146 non-null   int64
 7   has_chip               6146 non-null   object
 8   num_cards_issued       6146 non-null   int64
 9   credit_limit           6146 non-null   object
 10  acct_open_date         6146 non-null   object
 11  year_pin_last_changed  6146 non-null   int64
 12  card_on_dark_web       6146 non-null   object
dtypes: int64(6), object(7)
memory usage: 624.3+ KB
Transactions Missing:
 id                       0
date                     0
client_id                0
card_id                  0
amount                   0
use_chip                 0
merchant_id              0
merchant_city            0
merchant_state     1563700
zip                1652706
mcc                      0
errors            13094522
dtype: int64
Users Missing:
 id                   0
current_age          0
retirement_age       0
birth_year           0
birth_month          0
gender               0
address              0
latitude             0
longitude            0
per_capita_income    0
yearly_income        0
total_debt           0
credit_score         0
num_credit_cards     0
dtype: int64
Cards Missing:
 id                       0
client_id                0
card_brand               0
card_type                0
card_number              0
expires                  0
cvv                      0
has_chip                 0
num_cards_issued         0
credit_limit             0
acct_open_date           0
year_pin_last_changed    0
card_on_dark_web         0
dtype: int64

Handle Missing and Invalid Values
A. Transactions Table

In [16]:
# ----------------------------------------
# üîç 1. Handle duplicates
# ----------------------------------------
transactions.drop_duplicates(inplace=True)

# Convert 'date' to datetime
transactions['date'] = pd.to_datetime(transactions['date'], errors='coerce')

# Convert IDs to string (in case they‚Äôre numeric but identifiers)
transactions['id'] = transactions['id'].astype(str)
transactions['client_id'] = transactions['client_id'].astype(str)
transactions['card_id'] = transactions['card_id'].astype(str)
transactions['merchant_id'] = transactions['merchant_id'].astype(str)

In [17]:
# ----------------------------------------
# üí∞ 2. Clean 'amount' column
# ----------------------------------------
transactions['amount'] = (
    transactions['amount']
    .astype(str)
    .str.replace('[^0-9.-]', '', regex=True)  # remove symbols/commas
)
transactions['amount'] = pd.to_numeric(transactions['amount'], errors='coerce')

transactions = transactions[transactions['amount'].notnull()]
transactions = transactions[transactions['amount'] > 0]

In [18]:
# ----------------------------------------
# üí≥ 3. Handle categorical columns
# ----------------------------------------
# Fill missing chip usage with "Unknown"
transactions['use_chip'] = transactions['use_chip'].fillna('Unknown')

# Fill missing merchant info
transactions['merchant_city'] = transactions['merchant_city'].fillna('Unknown')
transactions['merchant_state'] = transactions['merchant_state'].fillna('Unknown')

# Fill missing ZIP or MCC with default or placeholder
transactions['zip'] = transactions['zip'].fillna('00000')
transactions['mcc'] = transactions['mcc'].fillna('Unknown')

In [20]:
# ----------------------------------------
# ‚ö†Ô∏è 4. Handle 'errors' column
# ----------------------------------------
# Standardize text (lowercase, trim)

transactions.loc[:, 'errors'] = transactions['errors'].replace(
    ['nan', 'none', ''],
    np.nan
)

In [21]:
print("\nMissing values:\n", transactions.isnull().sum())
print("\nData types:\n", transactions.dtypes)
print("\nCleaned shape:", transactions.shape)

Missing values:
 id                       0
date                     0
client_id                0
card_id                  0
amount                   0
use_chip                 0
merchant_id              0
merchant_city            0
merchant_state           0
zip                      0
mcc                      0
errors            12433446
dtype: int64

Data types:
 id                        object
date              datetime64[ns]
client_id                 object
card_id                   object
amount                   float64
use_chip                  object
merchant_id               object
merchant_city             object
merchant_state            object
zip                       object
mcc                        int64
errors                    object
dtype: object

Cleaned shape: (12635227, 12)

B. Users Table

In [23]:
# Step 1: Remove $ and commas, then convert to numeric
for col in ['yearly_income', 'total_debt', 'credit_score', 'per_capita_income']:
    users[col] = (
        users[col]
        .astype(str)                # ensure string type
        .str.replace(r'[\$,]', '', regex=True)  # remove $ and ,
        .astype(float)              # convert to float
    )

# Step 2: Fill missing numerical fields with median
num_cols = ['yearly_income', 'total_debt', 'credit_score', 'per_capita_income']
users[num_cols] = users[num_cols].fillna(users[num_cols].median())

# Step 3: Fill missing categorical fields with mode
users['gender'] = users['gender'].fillna(users['gender'].mode()[0])

C. Card table

In [25]:
import pandas as pd

# --- Remove duplicate card IDs ---
cards = cards.drop_duplicates(subset='id')

# --- Replace missing 'has_chip' or 'card_on_dark_web' flags ---
cards['has_chip'] = cards['has_chip'].fillna('No')
cards['card_on_dark_web'] = cards['card_on_dark_web'].fillna('No')

# --- Clean and convert 'credit_limit' ---
# Remove any $ or , and convert to float
cards['credit_limit'] = (
    cards['credit_limit']
    .astype(str)
    .str.replace(r'[\$,]', '', regex=True)
    .astype(float)
)

# Fill missing credit limits with median
cards['credit_limit'] = cards['credit_limit'].fillna(cards['credit_limit'].median())

# --- Convert date fields to datetime ---
cards['acct_open_date'] = pd.to_datetime(cards['acct_open_date'], errors='coerce')
cards['expires'] = pd.to_datetime(cards['expires'], errors='coerce')

Standardize Data Types

In [26]:
# Convert categorical columns to category dtype
transactions['use_chip'] = transactions['use_chip'].astype('category')
cards['card_brand'] = cards['card_brand'].astype('category')
users['gender'] = users['gender'].astype('category')

# Ensure numeric columns are numeric
transactions['amount'] = pd.to_numeric(transactions['amount'], errors='coerce')
users['credit_score'] = pd.to_numeric(users['credit_score'], errors='coerce')
cards['credit_limit'] = pd.to_numeric(cards['credit_limit'], errors='coerce')

In [29]:
transactions

,id,date,client_id,card_id,amount,use_chip,merchant_id,merchant_city,merchant_state,zip,mcc,errors
1,7475328,2010-01-01 00:02:00,561,4575,14.57,Swipe Transaction,67570,Bettendorf,IA,52722.0,5311,NaN
2,7475329,2010-01-01 00:02:00,1129,102,80.00,Swipe Transaction,27092,Vista,CA,92084.0,4829,NaN
3,7475331,2010-01-01 00:05:00,430,2860,200.00,Swipe Transaction,27092,Crown Point,IN,46307.0,4829,NaN
4,7475332,2010-01-01 00:06:00,848,3915,46.41,Swipe Transaction,13051,Harwood,MD,20776.0,5813,NaN
5,7475333,2010-01-01 00:07:00,1807,165,4.81,Swipe Transaction,20519,Bronx,NY,10464.0,5942,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
13305910,23761868,2019-10-31 23:56:00,1718,2379,1.11,Chip Transaction,86438,West Covina,CA,91792.0,5499,NaN
13305911,23761869,2019-10-31 23:56:00,1766,2066,12.80,Online Transaction,39261,ONLINE,Unknown,00000,5815,NaN
13305912,23761870,2019-10-31 23:57:00,199,1031,40.44,Swipe Transaction,2925,Allen,TX,75002.0,4900,NaN
13305913,23761873,2019-10-31 23:58:00,1986,5443,4.00,Chip Transaction,46284,Daly City,CA,94014.0,5411,NaN
13305914,23761874,2019-10-31 23:59:00,489,5697,12.88,Chip Transaction,24658,Greenbrier,TN,37073.0,5921,NaN

In [33]:
from sqlalchemy import create_engine
engine = create_engine(
    "mysql+pymysql://username:password@localhost:3306/datawarehouse"
)

In [35]:
users.to_sql(
    name='users',
    con=engine,
    if_exists='replace',
    index=False
)

2000

In [ ]:
transactions.to_sql(
    name='transactions',
    con=engine,
    if_exists='replace',   # use 'append' if table exists
    index=False
)

In [37]:
cards.to_sql(
    name='cards',
    con=engine,
    if_exists='replace',
    index=False
)

6146

In [38]:
pd.read_sql("SELECT * FROM users LIMIT 5", engine)

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,825,53,66,1966,11,Female,462 Rose Lane,34.15,-117.76,29278.0,59696.0,127613.0,787.0,5
1,1746,53,68,1966,12,Female,3606 Federal Boulevard,40.76,-73.74,37891.0,77254.0,191349.0,701.0,5
2,1718,81,67,1938,11,Female,766 Third Drive,34.02,-117.89,22681.0,33483.0,196.0,698.0,5
3,708,63,63,1957,1,Female,3 Madison Street,40.71,-73.99,163145.0,249925.0,202328.0,722.0,4
4,1164,43,70,1976,9,Male,9620 Valley Stream Drive,37.76,-122.44,53797.0,109687.0,183855.0,675.0,1